# Даний рядок у байтовому вигляді: b'rxx3xa9sumxc3xa9'
# закодована в кодуванні за умовчанням utf-8.
# Декодувати її у рядковий вигляд у кодуванні за замовчуванням.
# Потім результат знову перетворити на байтовий,
# тільки вже в кодуванні 'Latin1'
# І на кінець результат знову декодувати у рядок
# (Результати всіх перетворень виводити на екран).

st = b'rxx3xa9sumxc3xa9'
st_dec = st.decode("utf-8")
print(st_dec)
st_enc = st_dec.encode("latin-1")
print(st_enc)
st = st_enc.decode("latin-1")
print(st)
