# Написати програму використовуючи функції input() та print(). Програма
# вимагає ввести довільну строку. Потім необхідно створити 2 строкові змінні,
# перша з яких складається лише з парних символів введеної строки,
# а друга складається з введеної строки, написаної у зворотній послідовності,
# при цьому всі літери повинні бути написані у верхньому регістрі.
# Як результат вивести введену строку та дві нові строки, що вийшли,
# кожну з нового рядка.

st = input("Input string: ")
st_even = st[::2]
st_rev = st[::-1]
print(st, st_even, st_rev, sep='\n')
