# Використовуючи input() ввести речення, що складається з двох слів.
# Створити 2 змінні та в кожну записати по 1 введеному слову, використовуючи
# методи строк. Створити нову змінну трьома різними способами форматування
# (фактично 3 змінні), які складаються з введених слів у зворотному порядку,
# перше слово має складатися лише з великих літер, а друге з першої великої
# літери та інших дрібних. На початку речення повинен бути знак оклику,
# а в кінці запитальний.

# Використовуючи лише атрибути функції print(), вивести початковий рядок і
# отримані різними способами форматування через роздільник "<<<>>>".

# *Додаткове не обов'язкове завдання: вивід зробити у файл.
import os

txt = input("Input text with 2 words: ")
w1, w2 = txt.split()
print(w1, w2)

a = w1[::-1] + w2[::-1]
b = w1.upper()
c = w2.capitalize()

print(txt, a, b, c, sep="<<<>>>")

path = os.getcwd()
with open(f"{path}/output/dz_03.out", mode="w") as f:
    f.write("<<<>>>".join([txt, a, b, c]))
