# Використовуючи input() ввести речення, що складається з двох слів.
# Створити 2 змінні та в кожну записати по 1 введеному слову, використовуючи
# методи строк. Створити нову змінну трьома різними способами форматування
# (фактично 3 змінні), які складаються з введених слів у зворотному порядку,
# перше слово має складатися лише з великих літер, а друге з першої великої
# літери та інших дрібних. На початку речення повинен бути знак оклику,
# а в кінці запитальний.

# Використовуючи лише атрибути функції print(), вивести початковий рядок і
# отримані різними способами форматування через роздільник "<<<>>>".

# *Додаткове не обов'язкове завдання: вивід зробити у файл.

# Приклад виконання програми:
# введене речення: "кішка охайна"
# значення першої змінної: "кішка"
# значення другої змінної: "охайна"

# нова змінна: "!ОХАЙНА Кішка?"
# Цю змінну треба створити 3-ма різними способами форматування строк (%-форматування,
# метод .format та f-string). Буде 3 нові змінні з однаковими значеннями.

# Вивод функції print() повинен бути наступним:
# кішка охайна<<<>>>!ОХАЙНА Кішка?<<<>>>!ОХАЙНА Кішка?<<<>>>!ОХАЙНА Кішка?

import os

txt = input("Input text with 2 words: ")
a, b = txt.split()

a = a.capitalize()
b = b.upper()

s1 = f'!%s %s?' % (b, a)
s2 = '!{} {}?'.format(b, a)
s3 = f'!{b} {a}?'
print(txt, s1, s2, s3, sep="<<<>>>")

path = os.getcwd()
with open(f"{path}/output/dz_03.out", mode="w", encoding="utf-8") as f:
    f.write("<<<>>>".join([txt, s1, s2, s3]))
